import SurveyInfo from "./schemas/SurveyInfo";

const surveyData: SurveyInfo[] = [
  {
    id: "1",
    name: "Устраивает ли вас ассортимент товаров в Перекрестке?",
    creatorId: 'a',
    creationDate: new Date(Date.UTC(2024, 1, 1, 14, 52, 0)), 
    creatorName: "Морковкин И. И.", 
    description: `В современном мире качество продуктов питания играет ключевую роль в обеспечении здоровья и благополучия людей. \
    Торговая сеть «Перекрёсток» уделяет особое внимание качеству товаров, представленных на полках магазинов.\
    Опрос о качестве продуктов в «Перекрёстке» проводится с целью выявления предпочтений\
    покупателей в отношении здоровых перекусов. Это исследование поможет торговой сети\
    улучшить ассортимент и предложения в сегменте здорового питания, учитывая запросы целевой аудитории.`, 
    completionTime: 2, 
    questionCount: 5, 
    requiredCount: 3, 
    completionCount: 50,
    imgSrc: '/placeholder.png'
  },{
    id: "2",
    name: "Устраивает ли вас ассортимент товаров в Перекрестке?",
    creatorId: 'a',
    creationDate: new Date(Date.UTC(2024, 1, 1, 14, 52, 0)), 
    creatorName: "Морковкин И. И.", 
    description: `В современном мире качество продуктов питания играет ключевую роль в обеспечении здоровья и благополучия людей. \
    Торговая сеть «Перекрёсток» уделяет особое внимание качеству товаров, представленных на полках магазинов.\
    Опрос о качестве продуктов в «Перекрёстке» проводится с целью выявления предпочтений\
    покупателей в отношении здоровых перекусов. Это исследование поможет торговой сети\
    улучшить ассортимент и предложения в сегменте здорового питания, учитывая запросы целевой аудитории.`, 
    completionTime: 2, 
    questionCount: 5, 
    requiredCount: 3, 
    completionCount: 50,
    imgSrc: '/placeholder.png'
  },{
    id: "3",
    name: "Устраивает ли вас ассортимент товаров в Перекрестке?",
    creatorId: 'a',
    creationDate: new Date(Date.UTC(2024, 1, 1, 14, 52, 0)), 
    creatorName: "Морковкин И. И.", 
    description: `В современном мире качество продуктов питания играет ключевую роль в обеспечении здоровья и благополучия людей. \
    Торговая сеть «Перекрёсток» уделяет особое внимание качеству товаров, представленных на полках магазинов.\
    Опрос о качестве продуктов в «Перекрёстке» проводится с целью выявления предпочтений\
    покупателей в отношении здоровых перекусов. Это исследование поможет торговой сети\
    улучшить ассортимент и предложения в сегменте здорового питания, учитывая запросы целевой аудитории.`, 
    completionTime: 2, 
    questionCount: 5, 
    requiredCount: 3, 
    completionCount: 50,
    imgSrc: '/placeholder.png'
  },{
    id: "4",
    name: "Устраивает ли вас ассортимент товаров в Перекрестке?",
    creatorId: 'a',
    creationDate: new Date(Date.UTC(2024, 1, 1, 14, 52, 0)), 
    creatorName: "Морковкин И. И.", 
    description: `В современном мире качество продуктов питания играет ключевую роль в обеспечении здоровья и благополучия людей. \
    Торговая сеть «Перекрёсток» уделяет особое внимание качеству товаров, представленных на полках магазинов.\
    Опрос о качестве продуктов в «Перекрёстке» проводится с целью выявления предпочтений\
    покупателей в отношении здоровых перекусов. Это исследование поможет торговой сети\
    улучшить ассортимент и предложения в сегменте здорового питания, учитывая запросы целевой аудитории.`, 
    completionTime: 2, 
    questionCount: 5, 
    requiredCount: 3, 
    completionCount: 50,
    imgSrc: '/placeholder.png'
  }
]

export default surveyData;